Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized
CDelegateSynchronized includes all the platform invokable commands and synchronization to AKIT.

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.#ctor
DO NOT USE! For internal usage only!

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.InvokeRequired
Gets a value indicating whether the caller must call System.ComponentModel.ISynchronizeInvoke.Invoke(System.Delegate,System.Object[]) when calling an object that implements this interface.
Returns:  true if the caller must call System.ComponentModel.ISynchronizeInvoke.Invoke(System.Delegate,System.Object[]); otherwise, false.

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.BeginInvoke(System.Delegate,System.Object[])
Executes the delegate on the main thread that this object executes on.
Method: The given method.
Args: An array of type System.Object to pass as arguments to the given method. This can be null if no arguments are needed.
Returns:  An System.IAsyncResult interface that represents the asynchronous operation started by calling this method.

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.EndInvoke(System.IAsyncResult)
Waits until the process started by calling System.ComponentModel.ISynchronizeInvoke.BeginInvoke(System.Delegate,System.Object[]) completes, and then returns the value generated by the process.
Result: An System.IAsyncResult interface that represents the asynchronous operation started by calling System.ComponentModel.ISynchronizeInvoke.BeginInvoke(System.Delegate,System.Object[]).
Returns:  An System.Object that represents the return value generated by the asynchronous operation.

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.Invoke(System.Delegate,System.Object[])
Executes the delegate on the main thread that this object executes on.
Method: The given method.
Args: An array of type System.Object to pass as arguments to the given method. This can be null if no arguments are needed.
Returns:  An System.Object that represents the return value from the delegate being invoked, or null if the delegate has no return value.

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.ExportGetCurrentProgramVersion(Tekla.Structures.Internal.dotProgramVersion_t@)


Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.ExportGetCurrentUser(System.String@)


Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.ExportGetAdvancedOption(Tekla.Structures.Internal.dotGetAdvancedOption_t@)


Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.ExportGetToolOptionValue(System.String@)


Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.ExportGetSetClashCheckOptions(Tekla.Structures.Internal.dotClashCheckOptions_t@)


Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.ExportGetSetComponentOptions(Tekla.Structures.Internal.dotComponentOptions_t@)


Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.ExportTestingFeaturesHandler(Tekla.Structures.TeklaStructuresInternal.dotTestingFeaturesHandler_t@)


Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.ExportFeatureSupportHandler(Tekla.Structures.TeklaStructuresInternal.dotFeatureSupportHandler_t@)


Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.ExportGetModuleQuery(Tekla.Structures.Internal.dotModuleManagerQuery_t@)


Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.ExportGetAnalysisModuleQuery(Tekla.Structures.Internal.DotAnalysisModuleManagerQuery@)
pModuleQuery: The module query.
Returns: Returns TRUE if successfully retrieved modules in use.

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.ExportGetIdentifierByGUID(Tekla.Structures.Internal.dotIdentifierToGUID_t@)
pIdentifierToGUID: The GUID query.
Returns: Returns TRUE if successfull.

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.ExportGetAttributeFile(Tekla.Structures.TeklaStructuresInternal.dotGetAttributeFile_t@)
Gets single attribute file with specified name.
data: The data.
Returns: True if file was found.

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.dotExportGetCurrentProgramVersion(Tekla.Structures.Internal.dotProgramVersion_t@)
pProgramVersion:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.dotExportGetCurrentUser(System.Text.StringBuilder)
user:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.dotExportGetAdvancedOption(Tekla.Structures.Internal.dotGetAdvancedOption_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.dotExportGetToolOptionValue(System.String)
toolOptionName:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.dotExportGetSetClashCheckOptions(Tekla.Structures.Internal.dotClashCheckOptions_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.dotExportGetSetComponentOptions(Tekla.Structures.Internal.dotComponentOptions_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.dotExportTestingFeaturesHandler(Tekla.Structures.TeklaStructuresInternal.dotTestingFeaturesHandler_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.dotExportFeatureSupportHandler(Tekla.Structures.TeklaStructuresInternal.dotFeatureSupportHandler_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.dotExportGetModuleQuery(Tekla.Structures.Internal.dotModuleManagerQuery_t@)
pModuleQuery:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.DotAnalysisExportGetAnalysisModuleQuery(Tekla.Structures.Internal.DotAnalysisModuleManagerQuery@)
pModuleQuery: The module query.
Returns: Returns TRUE on success.

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.dotExportGetIdentifierByGUID(Tekla.Structures.Internal.dotIdentifierToGUID_t@)
pIdentifierToGUID: The identifier.
Returns: Returns TRUE on success.

Tekla.Structures.TeklaStructuresInternal.CDelegateSynchronized.dotExportGetAttributeFile(Tekla.Structures.TeklaStructuresInternal.dotGetAttributeFile_t@)
data: The Data.
Returns: True if file was found.